/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   is_correct_substring.c                             :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: oriabenk <oriabenk@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2025/01/23 12:42:17 by oriabenk          #+#    #+#             */
/*   Updated: 2025/01/25 11:13:38 by oriabenk         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "../inc/oshell.h"

/*
функція слугує для перевірки чи є строка коректною.
вона викликається у випадку дужок і перевіряє чи мість строка
знаки для розділення команди до дужок
*/

int	is_correct_substring(char *line, int i)
{
	while (i > 0 && line[i] && ft_isspace(line[i]))
		i--;
	if (i >= 0 && (line[i] != '&' && line[i] != '|'))
		return (0);
	return (1);
}
